# BuiltInFailures.AutoRouteFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AutoRouteFailures Class
BuiltInFailures Class Members See Also
---
Failures about AutoRoute.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class AutoRouteFailures
```

Visual Basic
---
```text
Public NotInheritable Class AutoRouteFailures
```

Visual C++
---
```text
public ref class AutoRouteFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..AutoRouteFailures
# See Also
BuiltInFailures..::..AutoRouteFailures Members
Autodesk.Revit.DB Namespace